#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.resources.data.google_iam_policy.noauth: Reading...
module.resources.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resources.google_cloud_run_service.service will be created
  + resource "google_cloud_run_service" "service" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "notification-api"
      + project                    = "angular-box-415904"
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 1800

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"
                  + name  = (known after apply)

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "128Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.resources.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-east1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "angular-box-415904"
      + service     = "notification-api"
    }

  # module.resources.google_cloudbuild_trigger.trigger will be created
  + resource "google_cloudbuild_trigger" "trigger" {
      + create_time     = (known after apply)
      + description     = "Deploy notification-api"
      + id              = (known after apply)
      + location        = "global"
      + name            = "notification-api-trigger"
      + project         = "angular-box-415904"
      + service_account = (known after apply)
      + substitutions   = (known after apply)
      + trigger_id      = (known after apply)

      + git_file_source {
          + path      = "infra/cloudbuild.yaml"
          + repo_type = "GITHUB"
          + revision  = "refs/heads/main"
          + uri       = "https://github.com/felipesilvaibi/notification-api"
        }

      + source_to_build {
          + ref       = "refs/heads/main"
          + repo_type = "GITHUB"
          + uri       = "https://github.com/felipesilvaibi/notification-api"
        }
    }

  # module.resources.google_project_iam_member.member["roles/cloudbuild.serviceAgent"] will be created
  + resource "google_project_iam_member" "member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "angular-box-415904"
      + role    = "roles/cloudbuild.serviceAgent"
    }

  # module.resources.google_project_iam_member.member["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "angular-box-415904"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.resources.google_project_iam_member.member["roles/pubsub.admin"] will be created
  + resource "google_project_iam_member" "member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "angular-box-415904"
      + role    = "roles/pubsub.admin"
    }

  # module.resources.google_project_iam_member.member["roles/run.admin"] will be created
  + resource "google_project_iam_member" "member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "angular-box-415904"
      + role    = "roles/run.admin"
    }

  # module.resources.google_project_iam_member.member["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "angular-box-415904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.resources.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "notification-api"
      + disabled     = false
      + display_name = "Service Account for notification-api"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "angular-box-415904"
      + unique_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @felipesilvaibi, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*